{
  "nav": {
    "home": "About Coaching",
    "about": "Our Coaches",
    "services": "Services"
  },
  "home": {
    "hero_title": "Partnering with you to bridge the gap from where you are to where you want to be.",
    "hero_subtitle": "Unlocking potential and achieving goals through professional coaching conversations."
  },
  "coaching": {
    "title": "What is Coaching?",
    "description": "The word 'Coach' might suggest instruction or advice, but the core spirit of professional coaching is quite the opposite. It is not top-down direction, but an equal 'partnership of exploration.' This relationship aims to empower you to find strength and answers from within.",
    "hiking_metaphor_title": "The Hiking Guide Metaphor",
    "hiking_metaphor_desc": "A coach is like a 'hiking guide'. The guide knows the terrain and can point out potential paths and landscapes, but ultimately, 'the hiker decides which path to take'. My role is to accompany you, helping you see your own strength, supporting your journey, not controlling it.",
    "core_principles_title": "Core Principles",
    "principles": [
      {
        "title": "Partner, Not Expert",
        "desc": "The coach is your 'partner in exploration', not an expert providing all the answers. We believe everyone has innate potential for self-growth and problem-solving, and my job is to help you uncover that potential."
      },
      {
        "title": "Listening & Questioning",
        "desc": "I will not give advice or instruction. Instead, through deep listening and curious questioning, I create a safe, non-judgmental space for you to discover your own solutions."
      },
      {
        "title": "Sparking Commitment",
        "desc": "The ultimate goal of coaching conversations is to 'spark commitment'. Through dialogue, we explore possibilities and translate them into concrete action plans to achieve your desires."
      }
    ],
    "neuroscience_title": "The Science Behind Coaching",
    "neuroscience_desc": "Neuroscience confirms that the brain loves to learn and build new neural pathways. The core function of coaching is to help clients 'create new habits' to replace old ones, rather than fighting them. This change based on intrinsic motivation is more energy-efficient and sustainable than relying solely on willpower.",
    "distinctions_title": "Distinctions from Other Professions",
    "distinction_1_title": "Therapy",
    "distinction_1_desc": "Focuses on past trauma and healing vs Coaching focuses on future possibilities and action.",
    "distinction_2_title": "Consulting",
    "distinction_2_desc": "Provides expert answers and diagnosis vs Coaching believes clients have their own answers.",
    "distinction_3_title": "Mentoring",
    "distinction_3_desc": "Senior guiding junior based on experience vs Coaching is a partnership without assumptions.",
    "target_audience_title": "Who is Coaching For?",
    "target_audience_desc": "Whether you are facing doubts or obstacles in Career, Family, Life Direction, or Pursuing Dreams, coaching can support you. Suitable partners typically possess the following traits:",
    "target_audience_list": [
      {
        "title": "Those willing to take responsibility for choices & actions",
        "desc": "A core coaching mindset is acknowledging that clients are responsible for their own choices. Suitable clients don't expect the coach to give orders or answers, but are willing to make their own decisions with guidance and support."
      },
      {
        "title": "Those seeking clarity & removing 'noise'",
        "desc": "For those who feel overwhelmed by overthinking. Coaching helps find focus, reprioritize goals, and find momentum when goals feel too open-ended."
      },
      {
        "title": "Those desiring self-transformation & 'becoming' better",
        "desc": "Coaching isn't just about achieving goals, but who you become in the process. For those seeking self-awareness, challenging blind spots, and meaningful change."
      },
      {
        "title": "Those in life transitions, challenges, or 'Survival Mode'",
        "desc": "Whether feeling stuck in survival mode, seeking structure amidst chaos, or wanting 'go-forward healing', coaching helps reconnect with your inner self."
      },
      {
        "title": "Those wanting to enhance leadership or relationships",
        "desc": "Helping professionals navigate complex dynamics, improve leadership effectiveness, and handle difficult conversations involving both emotion and logic."
      }
    ],
    "climber_metaphor_title": "The Climber's Mindset",
    "climber_metaphor_desc": "People seeking a coach are like climbers preparing for a new path. They don't want someone to carry their backpack or carry them to the summit. They want a guide who knows the terrain to point out paths, but ultimately, the climber retains the decision of which way to go, building strength along the way."
  },
  "about": {
    "title": "About Coach Isaac",
    "intro": "This is a unique invitation for collaboration, aiming to support your personal growth. Let's explore and open up new possibilities through conversation.",
    "bio_title": "My Journey & Commitment",
    "bio_content": "I am a professional coach currently undergoing International Coaching Federation (ICF) certification training, working towards the Associate Certified Coach (ACC) credential. In my practice, I strictly adhere to the high ethical standards and core values of the ICF, committed to providing a safe, trusting, and productive environment for dialogue.",
    "icf_title": "ICF & Professional Credentials",
    "icf_desc": "The ICF sets rigorous standards for the global coaching profession. Advancing from ACC to PCC involves not just accumulated hours, but a continuous refinement of the 'Coaching Mindset', 'Maintains Presence', and 'Deep Listening'.",
    "credentials": {
      "acc": "ACC (Associate Certified Coach): Entry level, requiring 60+ training hours and 100+ experience hours.",
      "pcc": "PCC (Professional Certified Coach): Professional level, requiring 125+ training hours and 500+ experience hours (My target goal).",
      "mindset": "Coaching Mindset: The coach is a partner, not an expert. We believe clients have the potential for self-growth and problem-solving."
    }
  },
  "coach_isaac": {
    "title": "Life Exploration & Practice Coach",
    "name": "Isaac Lu",
    "intro": "I deeply believe that everyone holds a goal they yearn to move towards. My vision is to partner with you, helping to minimize future regrets and increase your capacity for happiness.",
    "background_title": "Professional Background",
    "background_list": [
      "Software Development & Agile Practice",
      "Cross-functional Communication & Collaboration",
      "Team Facilitation & Consensus Building",
      "Professional Teaching Techniques & Curriculum Design",
      "The DEEP - Facilitator",
      "The DEEP - Intuitive Coach"
    ],
    "about_title": "About Me",
    "about_quote": "\"You already possess all the resources needed to solve your problems. The answers are within you, just waiting to be seen.\"",
    "about_content": "We all experience low points in life. When navigating through the fog, it's easy to miss clues and overlook opportunities for growth. Yet, I deeply believe that everyone holds a goal they yearn to move towards. My vision is to partner with you, helping to minimize future regrets and increase your capacity for happiness.",
    "focus_title": "Coaching Focus",
    "focus_list": [
      "Personal Growth & Self-Realization",
      "Career Navigation & Role Transition",
      "Leadership Mindset & Communication"
    ],
    "focus_quote": "\"Coaching is a profound companionship: accompanying you to explore the unknown, awaken awareness, and create change.\"",
    "style_title": "My Coaching Style",
    "style_list": [
      "Structured Logic with Empathetic Listening",
      "Safe, Inclusive & Non-judgmental Space"
    ],
    "style_core": "Combining logical structure with deep empathy, I help you organize chaotic thoughts into clear action paths, discovering your own answers in a safe space.",
    "practice_title": "Coaching Services",
    "practice_content": "I am currently in the coaching certification phase. Suitable for:",
    "practice_list": [
      "Those who crave continuous growth and self-breakthrough",
      "Those who have goals but feel stuck or unsatisfied with current progress",
      "Those who feel lost about the future, seeking clarity on the next step"
    ]
  },
  "services": {
    "title": "Services & Process",
    "philosophy": "My coaching practice is built on trust, respect, and a deep belief in your capacity for growth. I stand as your partner in exploration, genuinely believing in your potential. My goal is to guide and support you with an open, curious, and client-centered mindset, helping you discover your own solutions.",
    "agreement_title": "Coaching Agreement & Ethics",
    "agreement_items": [
      {
        "title": "Recording & Transcripts",
        "desc": "To facilitate ICF core competency assessment for my ACC credentialing, sessions will be recorded and may be transcribed."
      },
      {
        "title": "Client Consent",
        "desc": "Recordings will only be made with your full permission, ensuring you agree to their use for association review."
      },
      {
        "title": "Strict Confidentiality",
        "desc": "As an ICF professional coach, I adhere to the Gold Standard of ICF Ethics. I guarantee your conversations are strictly confidential and will not be disclosed to third parties, used solely for the ICF certification process."
      },
      {
        "title": "Client Responsibility",
        "desc": "Throughout the coaching relationship, you remain responsible for your own choices and actions."
      }
    ],
    "process_title": "How it Works",
    "process_steps": [
      {
        "title": "1. Discovery Session",
        "desc": "The first session to establish the 'Coaching Agreement', clarifying 'Where you want to go' and 'What you hope to achieve'."
      },
      {
        "title": "2. Regular Sessions",
        "desc": "Approx. 3 to 6 one-on-one sessions (online/offline), 45 mins each. Deep exploration and progress tracking."
      },
      {
        "title": "3. Transformation & Action",
        "desc": "Translating exploration into concrete action plans, sparking your commitment to achieve desired results."
      }
    ],
    "special_offer_title": "Limited Time Offer",
    "special_offer_desc": "As this is a special collaboration to support my certification, the fee for this service is simply 'a cup of coffee or a book'. I see this as a symbol of our shared investment in this journey."
  },
  "coach_pauline": {
    "title": "Life Vision & Enhancement Coach",
    "name": "Pauline Lin",
    "intro": "I believe everyone holds their own answers. A coach's role is to accompany you currently through deep listening and powerful questioning to see the situation clearly and move towards the change you truly desire.",
    "background_title": "Professional Background",
    "background_list": [
      "HR & Organizational Development",
      "Organizational Transformation, Cross-departmental Communication & Strategy",
      "Planning & Executing Internal Workshops and Training",
      "Managing tension and transition challenges between individual contributors, professionals, and management roles",
      "Lumina Spark Certified Practitioner"
    ],
    "about_title": "About Me",
    "about_quote": "Many stuck points are not due to lack of ability, but because expectations and inner conflicts haven't been sorted out.",
    "about_content": "I believe everyone holds their own answers. A coach's role is to accompany you through deep listening and powerful questioning to see the current situation clearly, clarify stuck points, and move towards the change you truly desire.",
    "focus_title": "Coaching Focus",
    "focus_list": [
      "Self-Awareness & Inner Belief Exploration",
      "Self-Labeling & Limiting Beliefs",
      "Workplace Challenges, Decision-making Difficulties & Inner Conflicts"
    ],
    "focus_quote": "A coach isn't here to tell you what to do, but to help you find the choices you are willing to be responsible for.",
    "style_title": "My Coaching Style",
    "style_list": [
      "Gentle but Direct: I will appropriately challenge limiting narratives.",
      "Safety with Logic: My safety isn't just emotional soothing, but ensuring your logic is caught and your inner self respected."
    ],
    "style_core": "In coaching conversations, I care about one thing: Helping you translate vague feelings into clear, understandable language.",
    "practice_title": "Practice Coaching Service",
    "practice_content": "I am currently in the coaching certification phase. Suitable for:",
    "practice_list": [
      "Those wanting to experience coaching conversations",
      "Those feeling stuck in a role or inner state",
      "Those hoping to be heard and organize their thoughts in a safe space"
    ]
  },
  "coach_vince": {
    "title": "Career, Life & Leadership Coach",
    "name": "Vincent Li",
    "intro": "I believe every traveler of life possesses enough potential and yet-to-be-unlocked wisdom to face, understand, and handle the various encounters on their work and life journey!",
    "background_title": "Professional Background",
    "background_list": [
      "HR Strategy & Management in Mid-to-Large Enterprises",
      "Business Process Diagnostic Consultant & University Lecturer",
      "Successful Cases in Cultivating Leadership & Effective Managers",
      "Amateur Investor"
    ],
    "about_title": "About Me",
    "about_quote": "\"Everyone's conscience and wisdom are equal; awaiting deeper exploration and inspiration to achieve a better self!\"",
    "about_content": "I believe every traveler of life possesses enough potential and yet-to-be-unlocked wisdom to face, understand, and handle the various encounters on their work and life journey! The hurdles faced while dwelling in this world require valuable companionship and dialogue, so one can live out a better version of themselves! \"Like sports coaches, accompanying/assisting you to find your angle and potential, but it is still you who takes the field!\"",
    "focus_title": "Coaching Focus",
    "focus_list": [
      "Where am I? Emotions?",
      "Dilemma? Opportunity?",
      "My Mindset",
      "The Greater Process"
    ],
    "focus_quote": "\"Doubts about the future... What happened to me? Why are they like that? My next step/direction in the AI era?\"",
    "style_title": "Coaching Style",
    "style_list": [
      "Humor & Sharp Insight (Smiling + A bit of seriousness)",
      "The Elder & The Child (Tolerance/Safety + Humility/Respect)"
    ],
    "style_core": "I hope you are well, and after becoming better, step by step, walk well towards the journey you desire!",
    "practice_title": "Coaching Services",
    "practice_content": "Currently in the coaching certification phase. Suitable for:",
    "practice_list": [
      "Those who also wanted to enter a coaching career and experience coaching dialogue",
      "Those facing career/growth stagnation and seeking breakthrough",
      "Those with management/leadership issues wanting to discover inner strength"
    ]
  },
  "coaches_index": {
    "title": "Our Coaches",
    "subtitle": "Choose the partner that fits your journey",
    "tab_all": "Overview"
  },
  "common": {
    "view_profile": "View Profile"
  }
}
