{
  "nav": {
    "home": "Home (What is Coaching)",
    "about": "About & Credential",
    "services": "Services"
  },
  "home": {
    "hero_title": "Partnering with you to bridge the gap from where you are to where you want to be.",
    "hero_subtitle": "Unlocking potential and achieving goals through professional coaching conversations."
  },
  "coaching": {
    "title": "What is Coaching?",
    "description": "The word 'Coach' might suggest instruction or advice, but the core spirit of professional coaching is quite the opposite. It is not top-down direction, but an equal 'partnership of exploration.' This relationship aims to empower you to find strength and answers from within.",
    "hiking_metaphor_title": "The Hiking Guide Metaphor",
    "hiking_metaphor_desc": "A coach is like a 'hiking guide'. The guide knows the terrain and can point out potential paths and landscapes, but ultimately, 'the hiker decides which path to take'. My role is to accompany you, helping you see your own strength, supporting your journey, not controlling it.",
    "core_principles_title": "Core Principles",
    "principles": [
      {
        "title": "Partner, Not Expert",
        "desc": "The coach is your 'partner in exploration', not an expert providing all the answers. We believe everyone has innate potential for self-growth and problem-solving, and my job is to help you uncover that potential."
      },
      {
        "title": "Listening & Questioning",
        "desc": "I will not give advice or instruction. Instead, through deep listening and curious questioning, I create a safe, non-judgmental space for you to discover your own solutions."
      },
      {
        "title": "Sparking Commitment",
        "desc": "The ultimate goal of coaching conversations is to 'spark commitment'. Through dialogue, we explore possibilities and translate them into concrete action plans to achieve your desires."
      }
    ],
    "neuroscience_title": "The Science Behind Coaching",
    "neuroscience_desc": "Neuroscience confirms that the brain loves to learn and build new neural pathways. The core function of coaching is to help clients 'create new habits' to replace old ones, rather than fighting them. This change based on intrinsic motivation is more energy-efficient and sustainable than relying solely on willpower.",
    "distinctions_title": "Distinctions from Other Professions",
    "distinction_1_title": "Therapy",
    "distinction_1_desc": "Focuses on past trauma and healing vs Coaching focuses on future possibilities and action.",
    "distinction_2_title": "Consulting",
    "distinction_2_desc": "Provides expert answers and diagnosis vs Coaching believes clients have their own answers.",
    "distinction_3_title": "Mentoring",
    "distinction_3_desc": "Senior guiding junior based on experience vs Coaching is a partnership without assumptions."
  },
  "about": {
    "title": "About Coach Isaac",
    "intro": "This is a unique invitation for collaboration, aiming to support your personal growth. Let's explore and open up new possibilities through conversation.",
    "bio_title": "My Journey & Commitment",
    "bio_content": "I am a professional coach currently undergoing International Coaching Federation (ICF) certification training, working towards the Associate Certified Coach (ACC) credential. In my practice, I strictly adhere to the high ethical standards and core values of the ICF, committed to providing a safe, trusting, and productive environment for dialogue.",
    "icf_title": "ICF & Professional Credentials",
    "icf_desc": "The ICF sets rigorous standards for the global coaching profession. Advancing from ACC to PCC involves not just accumulated hours, but a continuous refinement of the 'Coaching Mindset', 'Maintains Presence', and 'Deep Listening'.",
    "credentials": {
      "acc": "ACC (Associate Certified Coach): Entry level, requiring 60+ training hours and 100+ experience hours.",
      "pcc": "PCC (Professional Certified Coach): Professional level, requiring 125+ training hours and 500+ experience hours (My target goal).",
      "mindset": "Coaching Mindset: The coach is a partner, not an expert. We believe clients have the potential for self-growth and problem-solving."
    }
  },
  "services": {
    "title": "Services & Process",
    "philosophy": "Coaching is a journey we create together, starting with your goals and ending with your growth.",
    "process_title": "How it Works",
    "process_steps": [
      {
        "title": "1. Discovery Session",
        "desc": "The first session to establish the 'Coaching Agreement', clarifying 'Where you want to go' and 'What you hope to achieve'."
      },
      {
        "title": "2. Regular Sessions",
        "desc": "Approx. 3 to 6 one-on-one sessions (online/offline), 45 mins each. Deep exploration and progress tracking."
      },
      {
        "title": "3. Transformation & Action",
        "desc": "Translating exploration into concrete action plans, sparking your commitment to achieve desired results."
      }
    ],
    "special_offer_title": "Limited Time Offer",
    "special_offer_desc": "As this is a special collaboration to support my certification, the fee for this service is simply 'a cup of coffee or a book'. I see this as a symbol of our shared investment in this journey."
  }
}
